[{"Title": "NASA's New Mars Rover Is Ready for Space Lasers", "Preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"Title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "Preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}, {"Title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "Preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}, {"Title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "Preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"Title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "Preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"Title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "Preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"Title": "The Detective Aboard NASA's Perseverance Rover", "Preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"Title": "7 Things to Know About the Mars 2020 Perseverance Rover Mission", "Preview": "NASA's next rover to the Red Planet is slated to launch no earlier than July 30. These highlights will get you up to speed on the ambitious mission."}, {"Title": "NASA's Mars 2020 Rover Completes Its First Drive", "Preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"Title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "Preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"Title": "Three New Views of Mars' Moon Phobos", "Preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"Title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "Preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"Title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "Preview": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}, {"Title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "Preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"Title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "Preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}]